# Shell
brew "zsh"
brew "fasd"
brew "ripgrep"
brew "fzf"
brew "macvim", args: ['with-override-system-vim']

# Git
brew "git"
brew "git-flow"
brew "diff-so-fancy"

# Files
brew "unzip"

#database
brew "postgresql"
cask "sequel-pro"

# Apache
cask "java"
brew "hadoop"
brew "spark"
brew "kafka"
brew "cassandra"

# Terminal
cask "iterm2"

# Programming
cask "anaconda"

# Messaging
cask "slack"

# entertainment
cask "vlc"
cask "spotify"

#google
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-hangouts"

# IDE
cask "visual-studio-code"

