tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"

# Shell
brew "zsh"
brew "fasd"
brew "ripgrep"
brew "fzf"

# Git
brew "git"
brew "git-flow"
brew "diff-so-fancy"

# Files
brew "unzip"

# Database
brew "postgresql"
cask "sequel-pro"

# Apache
cask "java8"
brew "hadoop"
brew "spark"
brew "kafka"
brew "cassandra"

# Terminal
cask "iterm2"

# Programming
cask "anaconda"
cask "insomnia"

# Messaging
cask "slack"
cask "whatsapp"

# Entertainment
cask "vlc"
cask "spotify"

# Google
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-hangouts"

# IDE
cask "visual-studio-code"

# Linux
brew "vim", args: ['--with-override-system-vi', '--with-python', '--with-ruby']
brew "macvim", args: ['--with-override-system-vim']
brew "vimpager"
brew "openssh"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "tree"
brew "grep"
brew "gawk"
brew "wget"
brew "openldap"
brew "openssh"
brew "openssl"
brew "rsync"
brew "tmux"
brew "watch"
brew "htop"
brew "ack"

# Fonts
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-meslo-lg"
